# Time Shifting

In [2]:
import pandas as pd

In [3]:
df= pd.read_csv('starbucks.csv')

In [4]:
df.head()

         Date    Close    Volume
0  2015-01-02  38.0061   6906098
1  2015-01-05  37.2781  11623796
2  2015-01-06  36.9748   7664340
3  2015-01-07  37.8848   9732554
4  2015-01-08  38.4961  13170548

In [5]:
df= pd.read_csv('starbucks.csv',index_col='Date',parse_dates=True)

In [8]:
df.head()

              Close    Volume
Date
2015-01-02  38.0061   6906098
2015-01-05  37.2781  11623796
2015-01-06  36.9748   7664340
2015-01-07  37.8848   9732554
2015-01-08  38.4961  13170548

In [10]:
df.tail()

            Close    Volume
Date
2018-12-24  60.56   6323252
2018-12-26  63.08  16646238
2018-12-27  63.20  11308081
2018-12-28  63.39   7712127
2018-12-31  64.40   7690183

### Shift the time index by 1 means all data will go down by 1 row. and First input becomes NaN. We lose the info at the very last point.

In [12]:
df_new= df.shift(1)

In [14]:
df_new.head()

              Close      Volume
Date
2015-01-02      NaN         NaN
2015-01-05  38.0061   6906098.0
2015-01-06  37.2781  11623796.0
2015-01-07  36.9748   7664340.0
2015-01-08  37.8848   9732554.0

In [15]:
df_new.tail()

            Close      Volume
Date
2018-12-24  61.39  23524888.0
2018-12-26  60.56   6323252.0
2018-12-27  63.08  16646238.0
2018-12-28  63.20  11308081.0
2018-12-31  63.39   7712127.0

In [16]:
df_new2= df.shift(5)

In [19]:
df_new2.head(7)

              Close      Volume
Date
2015-01-02      NaN         NaN
2015-01-05      NaN         NaN
2015-01-06      NaN         NaN
2015-01-07      NaN         NaN
2015-01-08      NaN         NaN
2015-01-09  38.0061   6906098.0
2015-01-12  37.2781  11623796.0

In [20]:
df_new3= df.shift(-1)

In [21]:
df_new3.head()

              Close      Volume
Date
2015-01-02  37.2781  11623796.0
2015-01-05  36.9748   7664340.0
2015-01-06  37.8848   9732554.0
2015-01-07  38.4961  13170548.0
2015-01-08  37.2361  27556706.0

In [22]:
df_new3.tail()

            Close      Volume
Date
2018-12-24  63.08  16646238.0
2018-12-26  63.20  11308081.0
2018-12-27  63.39   7712127.0
2018-12-28  64.40   7690183.0
2018-12-31    NaN         NaN

In [23]:
df_new4= df.shift(periods=1, freq='M')

#### Everything will get pushed to the last date of that month

In [24]:
df_new4.head()

              Close    Volume
Date
2015-01-31  38.0061   6906098
2015-01-31  37.2781  11623796
2015-01-31  36.9748   7664340
2015-01-31  37.8848   9732554
2015-01-31  38.4961  13170548

In [25]:
df_new4.tail()

            Close    Volume
Date
2018-12-31  60.56   6323252
2018-12-31  63.08  16646238
2018-12-31  63.20  11308081
2018-12-31  63.39   7712127
2019-01-31  64.40   7690183